Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [3]:
data=[4, 8, 15, 16, 23,42]
series=pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it

In [4]:
list=[2,4,6, 8,10,12,14, 16,18,20 ]
series=pd.Series(list)
print(list)

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

Q3. Create a Pandas DataFrame that contains the following data:

In [19]:
list1=[{'Name':'Alice','Age':25,'Gender':'Female'},{'Name':'Bob','Age':30,'Gender':'Male'},{'Name':'Claire','Age':27,'Gender':'Female'}]
df=pd.DataFrame(list1)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

        In Pandas, a DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. It is like a spreadsheet or a SQL table, where rows represent the observations and columns represent the variables. A DataFrame can be thought of as a collection of Pandas Series, where each Series represents a column of the DataFrame.

        On the other hand, a Pandas Series is a 1-dimensional labeled array capable of holding data of any type. A Series can be thought of as a single column of data in a DataFrame.
        Here's an example to illustrate the difference between a Pandas Series and a DataFrame:

In [20]:
series=pd.Series([2,4,6, 8,10,12,14, 16,18,20 ],name='Numbers')


list3={'Name': pd.Series(['Ashutosh', 'Shan-A-Alam', 'FarazUncle']),'Age':pd.Series([25,30,27]) ,'Gender':(['male','Male','Female'])}
df=pd.DataFrame(list3)

print("Pandas Series:")
print(series)
print("\nData Frame")
df

Pandas Series:
0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
9    20
Name: Numbers, dtype: int64

Data Frame

          Name  Age  Gender
0     Ashutosh   25    male
1  Shan-A-Alam   30    Male
2   FarazUncle   27  Female

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?

        Pandas offers a wide range of functions that you can use to manipulate data in a DataFrame. Here are some common functions:

        1) head() and tail(): These functions allow you to view the first or last n rows of a DataFrame, respectively. For example, you can use df.head() to view the first five rows of a DataFrame named df.

        2) describe(): This function provides a summary of the statistical properties of each column in the DataFrame, such as the mean, standard deviation, and quartiles.

        3) loc[] and iloc[]: These functions allow you to slice and select specific rows and columns of the DataFrame. loc[] is used for label-based indexing, while iloc[] is used for integer-based indexing. For example, you can use df.loc[:, 'column_name'] to select all rows of a specific column named column_name.

        4) drop(): This function allows you to drop rows or columns from the DataFrame based on specific conditions. For example, you can use df.drop(df[df['column_name'] < 0].index) to drop all rows where the values in the column column_name are less than 0.

        5) groupby(): This function allows you to group the DataFrame by one or more columns and apply a function to each group. For example, you can use df.groupby('column_name').mean() to calculate the mean of each column for each unique value in the column column_name.

        6) merge(): This function allows you to join two or more DataFrames based on a common column. For example, you can use pd.merge(df1, df2, on='column_name') to join two DataFrames df1 and df2 on the column column_name.

        7) apply(): This function applies a function to each element of the DataFrame. For example, you can use df.apply(lambda x: x*2) to multiply each element of the DataFrame by 2. 

        Here's an example of how you might use one of these functions:
        Suppose you have a DataFrame named sales_data that contains information about sales of different products in different regions. You want to calculate the total sales for each region. You can use the groupby() function to group the DataFrame by the "region" column, and then apply the sum() function to calculate the total sales for each region:

In [25]:
import pandas as pd

# Creating a sample DataFrame
data = {'Product': ['A', 'B', 'C', 'A', 'B', 'C'],
        'Region': ['North', 'North', 'North', 'South', 'South', 'South'],
        'Sales': [100, 200, 150, 250, 300, 200]}
sales_data = pd.DataFrame(data)

# Grouping 
total_sales_by_region = sales_data.groupby('Region')['Sales'].sum()
df=pd.DataFrame(total_sales_by_region)

# Printing the total sales for each region
df

        Sales
Region
North     450
South     750

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

        In Pandas, both Series and DataFrame are mutable objects. That means you can modify their values, add new data, or delete data in-place. On the other hand, the Panel is deprecated and no longer recommended for use. Instead, you should use the more powerful and flexible MultiIndex objects to represent higher-dimensional data in Pandas. However, if you do use the Panel object, it is also mutable.
        Here's an example to demonstrate how Series and DataFrame can be modified in-place:

In [21]:
series=pd.Series([2,4,6, 8,10,12,14, 16,18,20 ],name='Numbers')

series[1] = 25 #modifying value in series
series[3] = 35


list3={'Name': pd.Series(['Tarique Zayan', 'Shan-A-Alam', 'FarazUncle']),'Age':pd.Series([25,30,27]) ,'Gender':(['male','Male','Female'])}
df=pd.DataFrame(list3)
                                ##modifying value in DataFrame
df.loc[1, 'Name'] = 'Ashutosh'
df.loc[1, 'Age'] = 21

## Printing the modified Series and DataFrame
print("Modified Series::")
print(series)
print("\nModified Data Frame")
df

Modified Series::
0     2
1    25
2     6
3    35
4    10
5    12
6    14
7    16
8    18
9    20
Name: Numbers, dtype: int64

Modified Data Frame

            Name  Age  Gender
0  Tarique Zayan   25    male
1       Ashutosh   21    Male
2     FarazUncle   27  Female

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [13]:
names = pd.Series(['Ashutosh', 'Shan-A-Alam', 'FarazUncle'])
ages = pd.Series([21, 30, 35])
salaries = pd.Series([500, 60000, 70000])

data = {'Name': names, 'Age': ages, 'Salary': salaries}
df = pd.DataFrame(data)


df

          Name  Age  Salary
0     Ashutosh   21     500
1  Shan-A-Alam   30   60000
2   FarazUncle   35   70000

    In this example, we first create three Pandas Series named "names", "ages", and "salaries". Then, we create a dictionary of these Series and pass it to the Pandas DataFrame constructor to create a DataFrame.
    When we print the DataFrame, we get the above output:
    In the output, you can see that the DataFrame has three columns named "Name", "Age", and "Salary", each containing the corresponding values from the Pandas Series. The DataFrame also has row indices that start from 0 and increment by 1 for each row.